let citys = ['台北市','新北市','桃園市', '台中市', '台南市', '高雄市'];
let citySelect = document.getElementById("city-list");
let inner = "";
for (let i = 0; i < citys.length; i++) {
    inner = inner + '<option value=' + citys[i] + '>' + citys[i] + '</option>';
}
citySelect.innerHTML = inner;

let regions = new Array();
regions[0] = ['中正區', '萬華區', '大同區', '中山區', '松山區', '大安區', '信義區', '士林區', '北投區', '內湖區', '南港區', '文山區'];
regions[1] = ['土城區', '板橋區', '林口區', '新莊區', '五股區', '泰山區', '新店區', '深坑區', '汐止區',
'八里區', '淡水區', '蘆洲區', '三重區', '永和區', '中和區', '鶯歌區', '三峽區', '樹林區',
'金山區', '三芝區', '瑞芳區', '萬里區', '雙溪區', '貢寮區', '石碇區', '石門區', '平溪區',
'坪林區'];
regions[2] = ['桃園區', '中壢區', '觀音區', '龍潭區', '楊梅區', '大園區', '蘆竹區', '八德區', '平鎮區',
'龜山區', '大溪區', '新屋區', '復興區'];
regions[3] = ['西區', '南區', '北區', '北屯區', '西屯區', '南屯區', '神岡區', '東勢區', '大雅區', '潭子區',
'大里區', '東區', '清水區', '梧棲區', '豐原區', '中區', '大甲區', '沙鹿區', '烏日區', '龍井區',
'太平區', '大肚區', '外埔區', '后里區', '霧峰區', '石岡區', '新社區', '大安區'];
regions[4] = ['北區', '安平區', '中西區', '安南區', '東區', '南區', '新營區', '佳里區', '新市區', '善化區',
'仁德區', '永康區', '麻豆區', '歸仁區', '楠西區', '後壁區', '新化區', '鹽水區', '西港區',
'玉井區', '將軍區', '白河區', '下營區', '柳營區', '關廟區', '學甲區', '東山區', '安定區',
'六甲區', '山上區', '官田區', '大內區', '北門區', '七股區', '左鎮區'];
regions[5] = ['鼓山區', '鹽埕區', '苓雅區', '新興區', '前鎮區', '小港區', '三民區', '左營區', '岡山區',
'鳳山區', '仁武區', '湖內區', '茄萣區', '大寮區', '楠梓區', '鳥松區', '前金區', '林園區',
'路竹區', '大社區', '梓官區', '阿蓮區', '橋頭區', '美濃區', '旗山區', '大樹區', '燕巢區',
'彌陀區', '旗津區', '甲仙區', '永安區', '六龜區'];
function changeCity(index) {
    let Cinner = "";
    for (let i = 0; i < regions[index].length; i++) {
        Cinner = Cinner + '<option value=' + regions[index][i] + '>' + regions[index][i] + '</option>';
    }
    let regionSelect = document.getElementById("region-list");
    regionSelect.innerHTML = Cinner;
}
changeCity(document.getElementById("city-list").selectedIndex);